Revit 2024 API
FabricationHostedInfo.DisconnectFromHost Method
 Disconnects the part from the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void DisconnectFromHost()
Visual Basic
Public Sub DisconnectFromHost
Visual C++
public:
void DisconnectFromHost()
See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace